//#include <stdio.h>
//int main()
//{
//	int i = 0;
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	for (i = 0; i <= 12; i++)
//	{
//		arr[i] = 0;
//		printf("hehe\n");
//	}
//	return 0;
//}


//整形家族:
//cahr 
//    char
//    unsigned  char
//    signed  char
//short
//     unsigned  short [int]
//     signed    short [int] 
//int 
//long
//long long 



//浮点型家族：
//float
//double  精度高，存储范围大


//构造类型：
//数组
//结构体  struct
//枚举  enum
//联合   union

//指针类型：
//int  *pi;
//char *pc;
// float *pf;
//void *pv;


//空类型：
//void

//void test(void)
//{
//}
//第一个void表示函数不会返回值
//第二个表示不需要传参数


//整形的存储

//正整数的反码 原码 补码  相同
//负的整数    反码+1=补码
//int main()
//{
//	int a = 20;
//	//00000000000000000000000010100
//	//0x00 00 00 14  十六进制
//	int b = -10;
//	//10000000000000000000000001010  原码
//	//0x80 00 00 0a
//	//11111111111111111111111110101  反码
//	//0xfffffff5
//	//11111111111111111111111110110  补码
//	//0xfffffff6
//
//
//	return 0;
//}

//整数内存中存的是补码二进制序列

//大小端
//大端字节序存储：
//把一个数据的高位字节序的内容放在低地址处，把低位字节序的内容放在高地址处，就是大端字节序存储

//小端字节序存储：
//把一个数据的高位字节序的内容放在高地址处，把低位字节序的内容放在低地址处，就是小端字节序存储

//设计一个小程序来判断当前机器的字节序
//代码1

int main()
{
	int a = 1;
	if (*(char*)&a == 1)
	{
		printf("小端\n");
	}
	else
	{
		printf("大端\n");
	}
	return 0;
}