#include <stdio.h>
//移位操作符
//7
//0000000000000000000000000111  原码
//0000000000000000000000000111  补码
//0000000000000000000000000111  反码

//-7
//1000000000000000000000000111  原码
//1111111111111111111111111001  补码（最低加一）
//1111111111111111111111111000  反码


//整数在内存中存的是补码
//int main()
//{
//	int a = 7;
//	//0000000000000000000000000111  补码  7
//	//左移
//	//0000000000000000000000001110  新的补码 14
//	//移动的是二进制位
//	//左边丢弃，右边补0
//	int b=a << 1;
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = -7;
//	//1111111111111111111111111001  补码  -7
//	//左移
//	//1111111111111111111111110010  新的补码 14
//	//移动的是二进制位
//	//左边丢弃，右边补0
//	int b = a << 1;
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//	return 0;
//}

//右移
// VS采用算术右移
//1.算数移位   右边丢弃，左边补原符号位
// 
//2.逻辑移位   右边丢弃，左边补0
//int main()
//{
//	int a = 7;
//	//0000000000000000000000000111  补码  7
//	// 右移
//	//0000000000000000000000000011  补码  3
//	int b = a >> 1;
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//	return 0;
//}
int main()
{
	int a = -7;
	//1111111111111111111111111001  补码  -7
	// 右移
	//1111111111111111111111111100  补码  -7
	int b = a >> 1;
	printf("a=%d\n", a);
	printf("b=%d\n", b);
	return 0;
}